tests/apache-bench/n100000c1000.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        eginx/0.1.0
Server Hostname:        localhost
Server Port:            8080

Document Path:          /
Document Length:        31 bytes

Concurrency Level:      1000
Time taken for tests:   13.582 seconds
Complete requests:      100000
Failed requests:        0
Total transferred:      20000000 bytes
HTML transferred:       3100000 bytes
Requests per second:    7362.52 [#/sec] (mean)
Time per request:       135.823 [ms] (mean)
Time per request:       0.136 [ms] (mean, across all concurrent requests)
Transfer rate:          1437.99 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   22  12.1     22      65
Processing:    11  113  48.3    106     347
Waiting:        1  103  47.4     96     330
Total:         13  135  46.6    131     358

Percentage of the requests served within a certain time (ms)
  50%    131
  66%    149
  75%    162
  80%    171
  90%    197
  95%    220
  98%    248
  99%    266
 100%    358 (longest request)