tests/apache-bench/n5000c1000.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        eginx/0.1.0
Server Hostname:        localhost
Server Port:            8080

Document Path:          /
Document Length:        31 bytes

Concurrency Level:      1000
Time taken for tests:   0.678 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      1000000 bytes
HTML transferred:       155000 bytes
Requests per second:    7376.67 [#/sec] (mean)
Time per request:       135.563 [ms] (mean)
Time per request:       0.136 [ms] (mean, across all concurrent requests)
Transfer rate:          1440.76 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   21   9.1     20      42
Processing:    14  101  46.3     93     259
Waiting:        2   92  45.7     85     240
Total:         35  122  46.2    114     290

Percentage of the requests served within a certain time (ms)
  50%    114
  66%    141
  75%    152
  80%    160
  90%    184
  95%    208
  98%    234
  99%    253
 100%    290 (longest request)